Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет        = Документы.РасходнаяНакладная.ПолучитьМакет("Печать");
	Запрос       = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасходнаяНакладная.Дата,
	|	РасходнаяНакладная.Договор,
	|	РасходнаяНакладная.Контрагент,
	|	РасходнаяНакладная.Номер,
	|	РасходнаяНакладная.Организация,
	|	РасходнаяНакладная.Склад,
	|	РасходнаяНакладная.СуммаДокумента,
	|	РасходнаяНакладная.Таблица.(
	|		НомерСтроки,
	|		Номенклатура,
	|		НаборСвойств,
	|		ЕдиницыИзмерения,
	|		Цена,
	|		Количество,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|ГДЕ
	|	РасходнаяНакладная.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок       = Макет.ПолучитьОбласть("Заголовок");
	Шапка                  = Макет.ПолучитьОбласть("Шапка");
	ОбластьТаблицаШапка    = Макет.ПолучитьОбласть("ТаблицаШапка");
	ОбластьТаблица         = Макет.ПолучитьОбласть("Таблица");
	ОбластьПодвалДокумента = Макет.ПолучитьОбласть("ПодвалДокумента");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	КоличествоСтрокТаблицы      = 0;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьТаблицаШапка);
		ВыборкаТаблица   = Выборка.Таблица.Выбрать();
		Пока ВыборкаТаблица.Следующий() Цикл
			ОбластьТаблица.Параметры.Заполнить(ВыборкаТаблица);
			ТабДок.Вывести(ОбластьТаблица, ВыборкаТаблица.Уровень());
			КоличествоСтрокТаблицы = КоличествоСтрокТаблицы+1;
		КонецЦикла;
		ПараметрыПодвала = Новый Структура();
		ПараметрыПодвала.Вставить("КоличествоСтрок", ВыборкаТаблица.Количество());//КоличествоСтрокТаблицы
        ОбластьПодвалДокумента.Параметры.Заполнить(Выборка);
        ОбластьПодвалДокумента.Параметры.Заполнить(ПараметрыПодвала);
        ТабДок.Вывести(ОбластьПодвалДокумента, Выборка.Уровень());
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
