
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	ПараметрыФормы = Новый Структура("Отбор, КлючНазначенияИспользования, СформироватьПриОткрытии",
	                                  Новый Структура("Склад",ПараметрКоманды), "ОстаткиПоСкладу", Истина);
	ОткрытьФорму("Отчет.ОтчетПоОстаткамТоваровНаСкладах.Форма", ПараметрыФормы,
	              ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность,
				  ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
