
//&НаСервере
//Процедура ЗаполнитьНаименованиеДоговораНаСервере()
//	
//	Объект.Наименование = "Договор №" + Объект.НомерДоговора + " от " + Формат(Объект.ДатаДоговора, "ДЛФ=DD");
//    Объект.Контрагент   = Объект.Владелец;

//КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНаименованиеДоговора(Команда)
	//Поле объета не доступно для записи
	//Элементы.Наименование = "Договор №" + Элементы.НомерДоговора + " от " + Формат(Элементы.ДатаДоговора, "ДФ=dd.MM.yyyy");
	//ЗаполнитьНаименованиеДоговораНаСервере();
   Объект.Наименование = "Договор №" + Объект.НомерДоговора + " от " + Формат(Объект.ДатаДоговора, "ДЛФ=DD");
   Объект.Контрагент   = Объект.Владелец;
   
   
КонецПроцедуры
