
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ПриходнаяНакладная.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПриходнаяНакладная.Дата,
	|	ПриходнаяНакладная.Договор,
	|	ПриходнаяНакладная.ЗаказПоставщику,
	|	ПриходнаяНакладная.Контрагент,
	|	ПриходнаяНакладная.Номер,
	|	ПриходнаяНакладная.Организация,
	|	ПриходнаяНакладная.Склад,
	|	ПриходнаяНакладная.СуммаДокумента,
	|	ПриходнаяНакладная.Таблица.(
	|		НомерСтроки,
	|		Номенклатура,
	|		НаборСвойств,
	|		ЕдиницыИзмерения,
	|		Цена,
	|		Количество,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
	|ГДЕ
	|	ПриходнаяНакладная.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТаблицаШапка = Макет.ПолучитьОбласть("ТаблицаШапка");
	ОбластьТаблица = Макет.ПолучитьОбласть("Таблица");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьТаблицаШапка);
		ВыборкаТаблица = Выборка.Таблица.Выбрать();
		Пока ВыборкаТаблица.Следующий() Цикл
			ОбластьТаблица.Параметры.Заполнить(ВыборкаТаблица);
			ТабДок.Вывести(ОбластьТаблица, ВыборкаТаблица.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
