
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив();
	
	Если ЭтотОбъект.ЭтоГруппа = Истина Тогда
		 НепроверяемыеРеквизиты.Добавить("ИНН");
	Иначе 
		// Проверка значения реквизита на соответствие некоторым требованиям
		Если НЕ ПроверкаИНН.ИННСоответствуетТребованиям(ИНН) Тогда
			Сообщение          = Новый СообщениеПользователю();
			Сообщение.Текст    = НСтр("ru = 'ИНН задан неверно.'");
			Сообщение.Поле     = "ИНН";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ              = Истина; 
			НепроверяемыеРеквизиты.Добавить("ИНН"); 
		КонецЕсли;
	КонецЕсли;
	 	
	

	
	УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);	

	
	
	
КонецПроцедуры

Процедура УдалитьНепроверяемыеРеквизитыИзМассива(МассивРеквизитов, МассивНепроверяемыхРеквизитов) Экспорт

	Для Каждого ЭлементМассива Из МассивНепроверяемыхРеквизитов Цикл
		
		// перед удалением реквизита из массива необходимо проверить, что он там есть
		// (не был удален ранее платформой или в коде).
		ПорядковыйНомер = МассивРеквизитов.Найти(ЭлементМассива);
		Если ПорядковыйНомер <> Неопределено Тогда
			МассивРеквизитов.Удалить(ПорядковыйНомер);
		КонецЕсли;
		
	КонецЦикла;
 
КонецПроцедуры