&НаСервереБезКонтекста
Функция ОбращениеНаСервер(ЕдиницыИзмерения)
	   Возврат ЕдиницыИзмерения.КоэффициентЕдиницыИзмерения;
КонецФункции

&НаКлиенте
Процедура ТаблицаЕдиницыИзмеренияПриИзменении(Элемент)

	 ТекСтрока                             = Элементы.Таблица.ТекущиеДанные;
	 ТекСтрока.КоэффициентЕдиницыИзмерения = ОбращениеНаСервер(ТекСтрока.ЕдиницыИзмерения);
	 ТекСтрока.Количество                  = 0;
	 ТекСтрока.Цена                        = 0;
	 ТекСтрока.Сумма                       = 0;
	 Объект.СуммаДокумента                 = Объект.Таблица.Итог("Сумма");
	 
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЦенаПриИзменении(Элемент)

	 ТекСтрока             = Элементы.Таблица.ТекущиеДанные;
	 ТекСтрока.Сумма       = ТекСтрока.Цена*ТекСтрока.Количество;
	 Объект.СуммаДокумента = Объект.Таблица.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКоличествоПриИзменении(Элемент)

	 ТекСтрока             = Элементы.Таблица.ТекущиеДанные;
	 ТекСтрока.Сумма       = ТекСтрока.Цена*ТекСтрока.Количество;
	 Объект.СуммаДокумента = Объект.Таблица.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСуммаПриИзменении(Элемент)
	
	 ТекСтрока             = Элементы.Таблица.ТекущиеДанные;
	 ТекСтрока.Сумма       = ТекСтрока.Цена*ТекСтрока.Количество;
     Объект.СуммаДокумента = Объект.Таблица.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНоменклатураПриИзменении(Элемент)
	
	 ТекСтрока             = Элементы.Таблица.ТекущиеДанные;
	 ТекСтрока.Количество  = 0;
	 ТекСтрока.Цена        = 0;
	 ТекСтрока.Сумма       = 0;
	 Объект.СуммаДокумента = Объект.Таблица.Итог("Сумма");

КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	//Одиночный подбор
	//ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора",,Элементы.Таблица);
	
	
	//ПараметрыФормы = Новый Структура("ЗакрыватьПриВыборе",Ложь);
	//ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы, Элементы.Таблица);
	
	//ПараметрыФормы = Новый Структура("МножественныйВыбор", Истина);
	//ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы, Элементы.Таблица);
	
	ПараметрыФормы = Новый Структура("МножественныйВыбор,ЗакрыватьПриВыборе", Истина, Ложь);
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы, Элементы.Таблица);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	//ОдиночныйВыбор
	//Элементы.Таблица.ДобавитьСтроку();
	//Элементы.Таблица.ТекущиеДанные.Номенклатура = ВыбранноеЗначение;

	//МножественныйВыбор
	Для каждого ВыбранныйЭлемент Из ВыбранноеЗначение Цикл
		
		СтруктураДляПоиска   = Новый Структура("Номенклатура", ВыбранныйЭлемент);
		НайденныйМассивСтрок = Объект.Таблица.НайтиСтроки(СтруктураДляПоиска);
	
		Если НайденныйМассивСтрок.Количество() = 0 Тогда
			НоваяСтрока              = Объект.Таблица.Добавить();
			НоваяСтрока.Номенклатура = ВыбранныйЭлемент;
			НоваяСтрока.Количество   = 1;
		Иначе
			НайденныйМассивСтрок[0].Количество = НайденныйМассивСтрок[0].Количество + 1;
		КонецЕсли;

		
	КонецЦикла;

КонецПроцедуры
