&НаКлиенте
Процедура ТаблицаНоменклатураПриИзменении(Элемент)
		
	 ТекСтрока                   = Элементы.Таблица.ТекущиеДанные;
	 ТекСтрока.ЕдиницыИзмерения  = 0;
	 ТекСтрока.Количество        = 0;	 
	 ТекСтрока.Цена              = 0;
	 ТекСтрока.Сумма             = 0;
	 Объект.СуммаДокумента       = Объект.Таблица.Итог("Сумма");
	 
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНаборСвойствПриИзменении(Элемент)

     ТекСтрока                   = Элементы.Таблица.ТекущиеДанные;
	 ТекСтрока.ЕдиницыИзмерения  = 0;
	 ТекСтрока.Количество        = 0;	 
	 ТекСтрока.Цена              = 0;
	 ТекСтрока.Сумма             = 0;
	 Объект.СуммаДокумента       = Объект.Таблица.Итог("Сумма");	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТаблицаЕдиницыИзмеренияПриИзмененииНаСервере(СтруктураСтроки)
	
	Запрос       = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			&ДатаДокумента,
	|			Номенклатура = &НоменклатураИзСтроки
	|				И Организация = &ОрганизацияИзСтроки
	|				И ЕдиницаИзмерения = &ЕдиницаИзмеренияИзСтроки
	|				И ВариантНоменклатуры = &ВариантНоменклатурыИзСтроки
	|				И ВидЦены = &ВидЦеныИзСтроки) КАК ЦеныНоменклатурыСрезПоследних";
	Запрос.УстановитьПараметр("ДатаДокумента"              , СтруктураСтроки.Дата);
	Запрос.УстановитьПараметр("НоменклатураИзСтроки"       , СтруктураСтроки.Номенклатура);
	Запрос.УстановитьПараметр("ОрганизацияИзСтроки"        , СтруктураСтроки.Организация);
	Запрос.УстановитьПараметр("ЕдиницаИзмеренияИзСтроки"   , СтруктураСтроки.ЕдиницыИзмерения);
	Запрос.УстановитьПараметр("ВариантНоменклатурыИзСтроки", СтруктураСтроки.НаборСвойств);
	Запрос.УстановитьПараметр("ВидЦеныИзСтроки"            , СтруктураСтроки.ВидЦен);
								
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		 ЦенаНоменклатуры = 0;
	Иначе
		 РезультатЗапроса = РезультатЗапроса.Выгрузить();
		 ЦенаНоменклатуры = РезультатЗапроса[0].Цена;
	КонецЕсли;
	
	СтруктураССервера = Новый Структура(); 
	СтруктураССервера.Вставить("ЦенаНоменклатуры",ЦенаНоменклатуры);
	СтруктураССервера.Вставить("КоэффициентЕдиницыИзмерения",СтруктураСтроки.ЕдиницыИзмерения.КоэффициентЕдиницыИзмерения);

	Возврат СтруктураССервера;	
	
КонецФункции

&НаКлиенте
Процедура ТаблицаЕдиницыИзмеренияПриИзменении(Элемент)
	
	ТекСтрока       = Элементы.Таблица.ТекущиеДанные;
	
	Если ПустаяСтрока(ТекСтрока.НаборСвойств) Тогда
		 Сообщить("Не заполнена колонка <<Набор свойств>> в строке № " + ТекСтрока.НомерСтроки + " таблицы");
		 Возврат;
	КонецЕсли;
	
	
	СтруктураСтроки = Новый Структура();
	СтруктураСтроки.Вставить("Номенклатура"    ,ТекСтрока.Номенклатура);
	СтруктураСтроки.Вставить("НаборСвойств"    ,ТекСтрока.НаборСвойств);
	СтруктураСтроки.Вставить("ЕдиницыИзмерения",ТекСтрока.ЕдиницыИзмерения);
	СтруктураСтроки.Вставить("Дата"            ,Объект.Дата);
	СтруктураСтроки.Вставить("Организация"     ,Объект.Организация);
	СтруктураСтроки.Вставить("ВидЦен"          ,Объект.ВидЦен);
 	
	СтруктураССервера = ТаблицаЕдиницыИзмеренияПриИзмененииНаСервере(СтруктураСтроки);
	
	
	ТекСтрока.Цена   = СтруктураССервера.ЦенаНоменклатуры;
	
	Если СтруктураССервера.ЦенаНоменклатуры = 0 Тогда
		 Сообщить("В регистре отсутствует цена на номенклатуру <<"+ТекСтрока.Номенклатура+">> со свойствами <<"+ТекСтрока.НаборСвойств+">>, ед.изм. <<"+ ТекСтрока.ЕдиницыИзмерения+">>");
	КонецЕсли;
	
	ТекСтрока.КоэффициентЕдиницыИзмерения = СтруктураССервера.КоэффициентЕдиницыИзмерения;
	ТекСтрока.Количество                  = 0;	 
	ТекСтрока.Сумма                       = 0;
	Объект.СуммаДокумента                 = Объект.Таблица.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКоличествоПриИзменении(Элемент)
	
	 ТекСтрока             = Элементы.Таблица.ТекущиеДанные;
	 ТекСтрока.Сумма       = ТекСтрока.Цена*ТекСтрока.Количество;
	 Объект.СуммаДокумента = Объект.Таблица.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЦенаПриИзменении(Элемент)
	
	 ТекСтрока             = Элементы.Таблица.ТекущиеДанные;
	 ТекСтрока.Сумма       = ТекСтрока.Цена*ТекСтрока.Количество;
	 Объект.СуммаДокумента = Объект.Таблица.Итог("Сумма");

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСуммаПриИзменении(Элемент)
	
	 ТекСтрока             = Элементы.Таблица.ТекущиеДанные;
	 ТекСтрока.Сумма       = ТекСтрока.Цена*ТекСтрока.Количество;
	 Объект.СуммаДокумента = Объект.Таблица.Итог("Сумма");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДоговорПриИзмененииНаСервере(Договор)
	
	Возврат Договор.ВидЦены;
	
КонецФункции

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	Объект.ВидЦен = ДоговорПриИзмененииНаСервере(Объект.Договор);

КонецПроцедуры




