
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения=Неопределено Тогда
		Возврат;		
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РезервированиеТовара") Тогда
		// Заполнение шапки
		ОбъектОснование = ДанныеЗаполнения.Ссылка;
		СтатусРезерва   = ДанныеЗаполнения.СтатусРезерва;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Если СтатусРезерва = Перечисления.СтатусыРезерва.Действующий Тогда
		
		//Если значение не пустое ОбъектОснование
		//Если статус резерва ОбъектОснование действующий!!!!
		
		Если ЗначениеЗаполнено(ОбъектОснование)  Тогда
			Если ОбъектОснование.СтатусРезерва<>Перечисления.СтатусыРезерва.Действующий Тогда
				Отказ = Истина;
				Сообщить("Резерв не может быть отменен, потому что его статус <<"+ ОбъектОснование.СтатусРезерва+">>. Для отмены резерва статус должен быть <<Действующий>>.");
				Возврат;	
			КонецЕсли;
		Иначе 
			Отказ = Истина;
			Сообщить("Поле  <<ОбъектОснование>> не заполнено!");
			Возврат;
			
		КонецЕсли;
		
		//очистить прошлые движения по документу
		Движения.РезервированиеТоваров.Очистить();
		Движения.РезервированиеТоваров.Записывать = Истина;
		Движения.Записать();
		
		Запрос       = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РезервированиеТовараТаблица.Номенклатура                 КАК Номенклатура,
		|	РезервированиеТовараТаблица.НаборСвойств                 КАК НаборСвойств,
		|	СУММА(РезервированиеТовараТаблица.Количество * РезервированиеТовараТаблица.КоэффициентЕдиницыИзмерения) КАК Количество,
		|	РезервированиеТовараТаблица.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры
		|ПОМЕСТИТЬ ТаблицаИзДокументаРезерва
		|ИЗ
		|	Документ.РезервированиеТовара.Таблица                    КАК РезервированиеТовараТаблица
		|ГДЕ
		|	РезервированиеТовараТаблица.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РезервированиеТовараТаблица.Номенклатура,
		|	РезервированиеТовараТаблица.НаборСвойств
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РезервированиеТовара.Организация          КАК Организация,
		|	РезервированиеТовара.Склад                КАК Склад,
		|	РезервированиеТовара.Контрагент           КАК Контрагент,
		|	РезервированиеТовара.Покупатель           КАК Покупатель,
		|	РезервированиеТовара.СтатусРезерва        КАК СтатусРезерва,
		|	ТаблицаИзДокументаРезерва.Номенклатура    КАК Номенклатура,
		|	ТаблицаИзДокументаРезерва.НаборСвойств    КАК НаборСвойств,
		|	ТаблицаИзДокументаРезерва.ВидНоменклатуры КАК ВидНоменклатуры,
		|	ТаблицаИзДокументаРезерва.Количество      КАК Количество
		|ИЗ
		|	Документ.РезервированиеТовара             КАК РезервированиеТовара,
		|	ТаблицаИзДокументаРезерва                 КАК ТаблицаИзДокументаРезерва
		|ГДЕ
		|	РезервированиеТовара.Ссылка = &Ссылка";
		
		
		Запрос.УстановитьПараметр("Ссылка", ОбъектОснование);
		
		РезультатЗапроса       = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		// Регистр РезервированиеТоваров Расход
		Движения.РезервированиеТоваров.Записывать = Истина;
		
		ЭтоТовар = Перечисления.ВидыНоменклатуры.Товар;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если ВыборкаДетальныеЗаписи.ВидНоменклатуры = ЭтоТовар Тогда
				
				Движение                        = Движения.РезервированиеТоваров.Добавить();
				Движение.ВидДвижения            = ВидДвиженияНакопления.Расход;
				Движение.Период                 = Дата;
				Движение.Организация            = ВыборкаДетальныеЗаписи.Организация;
				Движение.Склад                  = ВыборкаДетальныеЗаписи.Склад;
				Движение.Контрагент             = ВыборкаДетальныеЗаписи.Контрагент;
				Движение.Покупатель             = ВыборкаДетальныеЗаписи.Покупатель;	
				Движение.Номенклатура           = ВыборкаДетальныеЗаписи.Номенклатура;
				Движение.ВариантНоменклатуры    = ВыборкаДетальныеЗаписи.НаборСвойств;
				Движение.КоличествоРезерва      = ВыборкаДетальныеЗаписи.Количество;
				
			Иначе 
				
				
				Сообщить("Номенклатура <<"+ВыборкаДетальныеЗаписи.Номенклатура+">> с набором свойств <<"+
				ВыборкаДетальныеЗаписи.НаборСвойств+">> это не товар.");
				
			КонецЕсли;
			
		КонецЦикла;
		
		
		
		//Делаем проверку на наличие отрицательного резерва
		Запрос       = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РезервированиеТоваровОстатки.Организация                           КАК Организация,
		|	РезервированиеТоваровОстатки.Склад                                 КАК Склад,
		|	РезервированиеТоваровОстатки.Контрагент                            КАК Контрагент,
		|	РезервированиеТоваровОстатки.Покупатель                            КАК Покупатель,
		|	РезервированиеТоваровОстатки.Номенклатура                          КАК Номенклатура,
		|	РезервированиеТоваровОстатки.ВариантНоменклатуры                   КАК ВариантНоменклатуры,
		|	ЕСТЬNULL(РезервированиеТоваровОстатки.КоличествоРезерваОстаток, 0) КАК КоличествоРезерваОстаток
		|ИЗ
		|	РегистрНакопления.РезервированиеТоваров.Остатки(
		|			&ВыбДата,
		|			Организация = &ВыбОрганизация
		|				И Склад = &ВыбСклад
		|				И Контрагент = &ВыбКонтрагент
		|				И Покупатель = &ВыбПокупатель)                         КАК РезервированиеТоваровОстатки";
		
		Запрос.УстановитьПараметр("ВыбДата",        ТекущаяДата());   	
		Запрос.УстановитьПараметр("ВыбОрганизация", ОбъектОснование.Организация);
		Запрос.УстановитьПараметр("ВыбСклад",       ОбъектОснование.Склад);
		Запрос.УстановитьПараметр("ВыбКонтрагент",  ОбъектОснование.Контрагент);
		Запрос.УстановитьПараметр("ВыбПокупатель",  ОбъектОснование.Покупатель);
		
		ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если ВыборкаДетальныеЗаписи.КоличествоРезерваОстаток < 0 Тогда
				
				Сообщить("Номенклатура <<"+ВыборкаДетальныеЗаписи.Номенклатура+">> с набором свойств <<"+
				ВыборкаДетальныеЗаписи.ВариантНоменклатуры+">> превышает остаток в резерве! Проверьте документ: "+ 
				ОбъектОснование+" и посмотрите Отчет по резервированию товаров на складе.");
				Отказ = Истина;
				Продолжить;
				
			КонецЕсли;
			
		КонецЦикла;
		
		//Если по регистрам все хорошо прошло
		Если Отказ = Ложь Тогда
			
			//меняем старому документу резерва статус
			ДокОбъект                = ОбъектОснование.ПолучитьОбъект();
			ДокОбъект.СтатусРезерва  = Перечисления.СтатусыРезерва.Отмененный;
			ДокОбъект.ДокументОтмены = Ссылка;
			ДокОбъект.Записать();
			
			СтатусРезерва            = Перечисления.СтатусыРезерва.Отмененный;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
