
&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	РаботаСТабличнымиЧастямиДокументов.ПересчетСуммы(Элементы.Услуги.ТекущиеДанные);	

КонецПроцедуры

&НаКлиенте
Процедура УслугиДатаИВремяНачалаОказанияУслугиПриИзменении(Элемент)

	РаботаСТабличнымиЧастямиДокументов.ПересчетДатыИВремениОкончанияОказанияУслуги(Элементы.Услуги.ТекущиеДанные);
	РаботаСТабличнымиЧастямиДокументов.ПересчетСуммы(Элементы.Услуги.ТекущиеДанные);
	Объект.СуммаДокумента = Объект.Таблица.Итог("Сумма")+Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиДлительностьОказанияУслугиПриИзменении(Элемент)

	РаботаСТабличнымиЧастямиДокументов.ПересчетДатыИВремениОкончанияОказанияУслуги(Элементы.Услуги.ТекущиеДанные);
    РаботаСТабличнымиЧастямиДокументов.ПересчетСуммы(Элементы.Услуги.ТекущиеДанные);
	Объект.СуммаДокумента = Объект.Таблица.Итог("Сумма")+Объект.Услуги.Итог("Сумма");

КонецПроцедуры

&НаКлиенте
Процедура УслугиДатаИВремяОкончанияОказанияУслугиПриИзменении(Элемент)
	
	РаботаСТабличнымиЧастямиДокументов.ПересчетДатыИВремениОкончанияОказанияУслуги(Элементы.Услуги.ТекущиеДанные);
    РаботаСТабличнымиЧастямиДокументов.ПересчетСуммы(Элементы.Услуги.ТекущиеДанные);
	Объект.СуммаДокумента = Объект.Таблица.Итог("Сумма")+Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Склад = Тренерская();
	Сообщить("Для просмотра Суммы используйте горизонтальную полосу прокрутки.");

КонецПроцедуры

&НаСервереБезКонтекста
Функция Тренерская()
    Возврат Справочники.Склады.Тренерская;    
КонецФункции //Тренерская


&НаКлиенте
Процедура УслугиНаименованиеУслугиПриИзменении(Элемент)
	
	ТекСтрока                                = Элементы.Услуги.ТекущиеДанные;	
	ТекСтрока.ДатаИВремяНачалаОказанияУслуги = ТекущаяДата();
	ТекСтрока.ДлительностьОказанияУслуги     = Дата('00010101010000');
	РаботаСТабличнымиЧастямиДокументов.ПересчетДатыИВремениОкончанияОказанияУслуги(Элементы.Услуги.ТекущиеДанные);
	Объект.СуммаДокумента                    = Объект.Таблица.Итог("Сумма")+Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНоменклатураПриИзменении(Элемент)
	
	 ТекСтрока             = Элементы.Таблица.ТекущиеДанные;
	 ТекСтрока.Количество  = 0;
	 ТекСтрока.Цена        = 0;
	 ТекСтрока.Сумма       = 0;
	 Объект.СуммаДокумента = Объект.Таблица.Итог("Сумма")+Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТаблицаЕдиницыИзмеренияПриИзмененииНаСервере(СтруктураСтроки)
	
	
	ФизическоеЛицо = Справочники.Контрагенты.ФизическоеЛицо;
	Запрос1        = Новый Запрос;
	Запрос1.Текст  = 
					"ВЫБРАТЬ
					|	Договоры.ВидЦены КАК ВидЦены
					|ИЗ
					|	Справочник.Договоры КАК Договоры
					|ГДЕ
					|	Договоры.Владелец = &Владелец";
	Запрос1.УстановитьПараметр("Владелец", ФизическоеЛицо);
	РезультатЗапроса1 = Запрос1.Выполнить();
	
	Если РезультатЗапроса1.Пустой() Тогда
		 ВидЦен           = 0;
		 ЦенаНоменклатуры = 0;
	Иначе
		 РезультатЗапроса1 = РезультатЗапроса1.Выгрузить();
		 ВидЦен            = РезультатЗапроса1[0].ВидЦены;

		Запрос       = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			&ДатаДокумента,
		|			Номенклатура = &НоменклатураИзСтроки
		|				И Организация = &ОрганизацияИзСтроки
		|				И ЕдиницаИзмерения = &ЕдиницаИзмеренияИзСтроки
		|				И ВариантНоменклатуры = &ВариантНоменклатурыИзСтроки
		|				И ВидЦены = &ВидЦеныИзСтроки) КАК ЦеныНоменклатурыСрезПоследних";
		Запрос.УстановитьПараметр("ДатаДокумента"              , СтруктураСтроки.Дата);
		Запрос.УстановитьПараметр("НоменклатураИзСтроки"       , СтруктураСтроки.Номенклатура);
		Запрос.УстановитьПараметр("ОрганизацияИзСтроки"        , СтруктураСтроки.Организация);
		Запрос.УстановитьПараметр("ЕдиницаИзмеренияИзСтроки"   , СтруктураСтроки.ЕдиницыИзмерения);
		Запрос.УстановитьПараметр("ВариантНоменклатурыИзСтроки", СтруктураСтроки.НаборСвойств);
		Запрос.УстановитьПараметр("ВидЦеныИзСтроки"            , ВидЦен);
									
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			 ЦенаНоменклатуры = 0;
		Иначе
			 РезультатЗапроса = РезультатЗапроса.Выгрузить();
			 ЦенаНоменклатуры = РезультатЗапроса[0].Цена;
		КонецЕсли;
	
	КонецЕсли;
	
	СтруктураССервера = Новый Структура(); 
	СтруктураССервера.Вставить("ЦенаНоменклатуры",ЦенаНоменклатуры);
	СтруктураССервера.Вставить("КоэффициентЕдиницыИзмерения",СтруктураСтроки.ЕдиницыИзмерения.КоэффициентЕдиницыИзмерения);

	Возврат СтруктураССервера;
	
КонецФункции

&НаКлиенте
Процедура ТаблицаЕдИзмПриИзменении(Элемент)
	
	 ТекСтрока = Элементы.Таблица.ТекущиеДанные;
	 
	 Если ПустаяСтрока(ТекСтрока.НаборСвойств) Тогда
		 Сообщить("Не заполнена колонка <<Набор свойств>> в строке № " + ТекСтрока.НомерСтроки + " таблицы");
		 Возврат;
	 КонецЕсли;
	
	
	 СтруктураСтроки = Новый Структура();
	 СтруктураСтроки.Вставить("Номенклатура"    ,ТекСтрока.Номенклатура);
	 СтруктураСтроки.Вставить("НаборСвойств"    ,ТекСтрока.НаборСвойств);
	 СтруктураСтроки.Вставить("ЕдиницыИзмерения",ТекСтрока.ЕдИзм);
	 СтруктураСтроки.Вставить("Дата"            ,Объект.Дата);
	 СтруктураСтроки.Вставить("Организация"     ,Объект.Организация);
	 	
	 СтруктураССервера = ТаблицаЕдиницыИзмеренияПриИзмененииНаСервере(СтруктураСтроки);
	
	 ТекСтрока.Цена    = СтруктураССервера.ЦенаНоменклатуры;
	
	 Если СтруктураССервера.ЦенаНоменклатуры = 0 Тогда
		  Сообщить("В регистре отсутствует цена на номенклатуру <<"+ТекСтрока.Номенклатура+">> со свойствами <<"+ТекСтрока.НаборСвойств+">>, ед.изм. <<"+ ТекСтрока.ЕдИзм+">>");
	 КонецЕсли;
	
	 ТекСтрока.КоэффициентЕдиницыИзмерения = СтруктураССервера.КоэффициентЕдиницыИзмерения;
	 
	 ТекСтрока.Количество  = 0;
	 ТекСтрока.Сумма       = 0;
	 Объект.СуммаДокумента = Объект.Таблица.Итог("Сумма")+Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНаборСвойствПриИзменении(Элемент)
	
	 ТекСтрока             = Элементы.Таблица.ТекущиеДанные;
	 ТекСтрока.Количество  = 0;
	 ТекСтрока.Цена        = 0;
	 ТекСтрока.Сумма       = 0;
	 Объект.СуммаДокумента = Объект.Таблица.Итог("Сумма")+Объект.Услуги.Итог("Сумма");

	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЕдИзмКоэффициентЕдиницыИзмеренияПриИзменении(Элемент)
	
	 ТекСтрока             = Элементы.Таблица.ТекущиеДанные;
	 ТекСтрока.Количество  = 0;
	 ТекСтрока.Цена        = 0;
	 ТекСтрока.Сумма       = 0;
	 Объект.СуммаДокумента = Объект.Таблица.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКоличествоПриИзменении(Элемент)
	
	 ТекСтрока             = Элементы.Таблица.ТекущиеДанные;
	 ТекСтрока.Сумма       = ТекСтрока.Цена*ТекСтрока.Количество;
	 Объект.СуммаДокумента = Объект.Таблица.Итог("Сумма") + Объект.Услуги.Итог("Сумма");

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЦенаПриИзменении(Элемент)
	
	 ТекСтрока             = Элементы.Таблица.ТекущиеДанные;
	 ТекСтрока.Сумма       = ТекСтрока.Цена*ТекСтрока.Количество;
	 Объект.СуммаДокумента = Объект.Таблица.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСуммаПриИзменении(Элемент)
	
	 ТекСтрока             = Элементы.Таблица.ТекущиеДанные;
	 ТекСтрока.Сумма       = ТекСтрока.Цена*ТекСтрока.Количество;
	 Объект.СуммаДокумента = Объект.Таблица.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

