&НаСервереБезКонтекста
Функция ОбращениеНаСервер(ЕдиницыИзмерения)
	   Возврат ЕдиницыИзмерения.КоэффициентЕдиницыИзмерения;
КонецФункции

&НаКлиенте
Процедура ТаблицаЕдиницыИзмеренияПриИзменении(Элемент)
	
	 ТекСтрока                             = Элементы.Таблица.ТекущиеДанные;
	 ТекСтрока.КоэффициентЕдиницыИзмерения = ОбращениеНаСервер(ТекСтрока.ЕдиницыИзмерения);
	 ТекСтрока.Количество                  = 0;
	 ТекСтрока.Цена                        = 0;
	 ТекСтрока.Сумма                       = 0;
	 Объект.СуммаДокумента                 = Объект.Таблица.Итог("Сумма");
	 
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЦенаПриИзменении(Элемент)
	
	 ТекСтрока             = Элементы.Таблица.ТекущиеДанные;
	 ТекСтрока.Сумма       = ТекСтрока.Цена*ТекСтрока.Количество;
	 Объект.СуммаДокумента = Объект.Таблица.Итог("Сумма");
	 
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКоличествоПриИзменении(Элемент)
	
	 ТекСтрока             = Элементы.Таблица.ТекущиеДанные;
	 ТекСтрока.Сумма       = ТекСтрока.Цена*ТекСтрока.Количество;
     Объект.СуммаДокумента = Объект.Таблица.Итог("Сумма");
	 
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСуммаПриИзменении(Элемент)

	 ТекСтрока             = Элементы.Таблица.ТекущиеДанные;
	 ТекСтрока.Сумма       = ТекСтрока.Цена*ТекСтрока.Количество;
	 Объект.СуммаДокумента = Объект.Таблица.Итог("Сумма");
	 
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНомеклатураПриИзменении(Элемент)
	
	 ТекСтрока             = Элементы.Таблица.ТекущиеДанные;
	 ТекСтрока.Количество  = 0;
	 ТекСтрока.Цена        = 0;
	 ТекСтрока.Сумма       = 0;
	 Объект.СуммаДокумента = Объект.Таблица.Итог("Сумма");

	
КонецПроцедуры
