&НаКлиенте
Процедура ПересчетСуммы(ТекСтрока) Экспорт
	
	Если      ТекСтрока.Цена < 0 Тогда
	
		Предупреждение("Цена не может быть отрицательной!");
		ТекСтрока.Цена = 0-ТекСтрока.Цена;
		Сообщить("Исправлено значение Цена = " + Строка(ТекСтрока.Цена));
	
	ИначеЕсли ТекСтрока.Цена > 99999999.99 Тогда
	
	    Предупреждение("Цена не может быть больше, чем 99999999,99!");
	    ТекСтрока.Цена = 99999999.99;
	    Сообщить("Исправлено значение Цена = " + Строка(ТекСтрока.Цена) );
	
	КонецЕсли;
	
	
	Попытка
		
		Если ТекСтрока.Цена*ВычислитьКоличествоВремени(ТекСтрока.ДлительностьОказанияУслуги)>99999999.99 Тогда
		
			 Сообщить("Переполнение значения Сумма!");
			 Предупреждение("Переполнение значения Сумма!");
		
		КонецЕсли;
		
		
		ТекСтрока.Сумма = ТекСтрока.Цена*ВычислитьКоличествоВремени(ТекСтрока.ДлительностьОказанияУслуги);
		

		//ТекСтрока.Сумма =5/0;
	Исключение
		Инфо = ИнформацияОбОшибке();
    	Сообщить("Описание='" + Инфо.Описание + "'");
    	Сообщить("ИмяМодуля='" + Инфо.ИмяМодуля + "'");
    	Сообщить("НомерСтроки=" + Инфо.НомерСтроки);
    	Сообщить("ИсходнаяСтрока='" + Инфо.ИсходнаяСтрока + "'");	
	КонецПопытки;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчетДатыИВремениОкончанияОказанияУслуги(ТекСтрока)   Экспорт
	
	ТекСтрока.ДатаИВремяОкончанияОказанияУслуги = ТекСтрока.ДатаИВремяНачалаОказанияУслуги+ВычислитьЧислоСекунд(ТекСтрока.ДлительностьОказанияУслуги);

КонецПроцедуры

&НаКлиенте
Функция ВычислитьЧислоСекунд(ДанныеТипаДата) Экспорт

	ЧислоСекунд = Секунда(ДанныеТипаДата)+Минута(ДанныеТипаДата)*60+Час(ДанныеТипаДата)*60*60;
	Возврат ЧислоСекунд;

КонецФункции // ВычислитьЧислоСекунд()

&НаКлиенте
Функция ВычислитьКоличествоВремени(ДанныеТипаДата)   Экспорт

	КоличествоВремениВЧасах = ВычислитьЧислоСекунд(ДанныеТипаДата)/(60*60);	
	Возврат КоличествоВремениВЧасах;
	
КонецФункции // ВычислитьКоличествоВремени()