&НаСервере
Функция ИННСоответствуетТребованиям(ИНН)    Экспорт

	ДлинаИНН=СтрДлина(ИНН);
	
	Если ДлинаИНН=10 ИЛИ ДлинаИНН=12 Тогда
		
		Флаг=Ложь;
		Для Сч =1  По ДлинаИНН Цикл
			
			Символ=Сред(ИНН,Сч,1);
			
			Если  СимволЭтоЦифра(Символ) Тогда
				  Продолжить;
			Иначе 
				  Флаг = Истина;
				  Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если Флаг = Истина Тогда
			Возврат Ложь;
		Иначе 
			Возврат Истина;
		КонецЕсли;
		
	Иначе
		Возврат Ложь;
    КонецЕсли;	

КонецФункции 

&НаСервере
Функция СимволЭтоЦифра(Символ) Экспорт

	Если Символ="0" 
		ИЛИ Символ="1"
		ИЛИ Символ="2" 
		ИЛИ Символ="3" 
		ИЛИ Символ="4" 
		ИЛИ Символ="5" 
		ИЛИ Символ="6" 
		ИЛИ Символ="7" 
		ИЛИ Символ="8" 
		ИЛИ Символ="9"
		Тогда Возврат Истина;

	Иначе 

	 	Возврат Ложь;

	КонецЕсли;	
	
КонецФункции