
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ОбновитьДатуДвижений = ЭтоНовый() ИЛИ Движения.ОстаткиТоваровНаСкладах.Модифицированность();
	
	Если Не ОбновитьДатуДвижений Тогда
		Запрос           = Новый Запрос;
		Запрос.Текст     = 
		"ВЫБРАТЬ
		|	ВводНачальныхОстатковНоменклатуры.Дата     КАК Дата
		|ИЗ
		|	Документ.ВводНачальныхОстатковНоменклатуры КАК ВводНачальныхОстатковНоменклатуры
		|ГДЕ
		|	ВводНачальныхОстатковНоменклатуры.Ссылка = &ТекущийДокумент";
		Запрос.УстановитьПараметр("ТекущийДокумент",Ссылка );
		РезультатЗапроса     = Запрос.Выполнить();
		Выборка              = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ОбновитьДатуДвижений = Выборка.Дата > Дата;		
	КонецЕсли;
	
	Если ОбновитьДатуДвижений Тогда
		
		Если Не Движения.ОстаткиТоваровНаСкладах.Выбран() Тогда
			Движения.ОстаткиТоваровНаСкладах.Прочитать();			
		КонецЕсли;
		
		Для каждого ЗаписьРегистра Из Движения.ОстаткиТоваровНаСкладах Цикл
			ЗаписьРегистра.Период = Дата;			
		КонецЦикла;
		
	КонецЕсли;
	
	ОбновитьДатуДвижений = ЭтоНовый() ИЛИ Движения.ПартииТоваровНаСкладах.Модифицированность();
	
	Если Не ОбновитьДатуДвижений Тогда
		Запрос           = Новый Запрос;
		Запрос.Текст     = 
		"ВЫБРАТЬ
		|	ВводНачальныхОстатковНоменклатуры.Дата     КАК Дата
		|ИЗ
		|	Документ.ВводНачальныхОстатковНоменклатуры КАК ВводНачальныхОстатковНоменклатуры
		|ГДЕ
		|	ВводНачальныхОстатковНоменклатуры.Ссылка = &ТекущийДокумент";
		Запрос.УстановитьПараметр("ТекущийДокумент",Ссылка );
		РезультатЗапроса     = Запрос.Выполнить();
		Выборка              = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ОбновитьДатуДвижений = Выборка.Дата > Дата;		
	КонецЕсли;
	
	Если ОбновитьДатуДвижений Тогда
		
		Если Не Движения.ПартииТоваровНаСкладах.Выбран() Тогда
			Движения.ПартииТоваровНаСкладах.Прочитать();			
		КонецЕсли;
		
		Для каждого ЗаписьРегистра Из Движения.ПартииТоваровНаСкладах Цикл
			ЗаписьРегистра.Период = Дата;			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
