&НаКлиенте
Процедура ПриОткрытии(Отказ)

	НачалоПериода = НачалоМесяца(ТекущаяДата());
	КонецПериода  = КонецДня(ТекущаяДата());
	ПриОткрытииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	ВыбЗаказы = Документы.ЗаказПоставщику.Выбрать(НачалоПериода,КонецПериода);
	
	Пока ВыбЗаказы.Следующий() Цикл
		СтрокаЗаказы                = Объект.Заказы.Добавить();
		СтрокаЗаказы.ДокументЗаказа = ВыбЗаказы.Ссылка;
		СтрокаЗаказы.СуммаДокумента = ВыбЗаказы.СуммаДокумента;
	КонецЦикла;

	ВыбПоступления = Документы.ПриходнаяНакладная.Выбрать(НачалоПериода,КонецПериода);
	
	Пока ВыбПоступления.Следующий() Цикл
		СтрокаПоступления                     = Объект.Поступления.Добавить();
		СтрокаПоступления.ДокументПоступления = ВыбПоступления.Ссылка;
		СтрокаПоступления.СуммаДокумента      = ВыбПоступления.СуммаДокумента;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	ПериодПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	ПериодПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПериодПриИзмененииНаСервере()

	ВыбЗаказы = Документы.ЗаказПоставщику.Выбрать(НачалоПериода,КонецПериода);
	
	Объект.Заказы.Очистить();
	
	Пока ВыбЗаказы.Следующий() Цикл
		СтрокаЗаказы                = Объект.Заказы.Добавить();
		СтрокаЗаказы.ДокументЗаказа = ВыбЗаказы.Ссылка;
		СтрокаЗаказы.СуммаДокумента = ВыбЗаказы.СуммаДокумента;
	КонецЦикла;

	ВыбПоступления = Документы.ПриходнаяНакладная.Выбрать(НачалоПериода,КонецПериода);
	
	Объект.Поступления.Очистить();
	
	Пока ВыбПоступления.Следующий() Цикл
		СтрокаПоступления                     = Объект.Поступления.Добавить();
		СтрокаПоступления.ДокументПоступления = ВыбПоступления.Ссылка;
		СтрокаПоступления.СуммаДокумента      = ВыбПоступления.СуммаДокумента;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//НачалоПериода = Дата("20220101");
	//КонецПериода  = КонецДня(ТекущаяДата()); 
	
	//ВыбЗаказы      = Документы.ЗаказПоставщику.Выбрать(Дата("20220101"),КонецДня(ТекущаяДата()));
	//
	//Пока ВыбЗаказы.Следующий() Цикл
	//	СтрокаЗаказы                = Объект.Заказы.Добавить();
	//	СтрокаЗаказы.ДокументЗаказа = ВыбЗаказы.Ссылка;
	//	СтрокаЗаказы.СуммаДокумента = ВыбЗаказы.СуммаДокумента;
	//КонецЦикла;

	//ВыбПоступления = Документы.ПриходнаяНакладная.Выбрать(Дата("20220101"),КонецДня(ТекущаяДата()));
	//
	//Пока ВыбПоступления.Следующий() Цикл
	//	СтрокаПоступления                     = Объект.Поступления.Добавить();
	//	СтрокаПоступления.ДокументПоступления = ВыбПоступления.Ссылка;
	//	СтрокаПоступления.СуммаДокумента      = ВыбПоступления.СуммаДокумента;
	//КонецЦикла;
	
КонецПроцедуры
