

Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ПриходноКассовыйОрдер.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПриходноКассовыйОрдер.Дата,
	|	ПриходноКассовыйОрдер.Номер,
	|	ПриходноКассовыйОрдер.Организация,
	|	ПриходноКассовыйОрдер.ПринятоОт,
	|	ПриходноКассовыйОрдер.СуммаДокумента,
	|	ПриходноКассовыйОрдер.Услуги.(
	|		НомерСтроки,
	|		НаименованиеУслуги,
	|		НаборСвойств,
	|		Цена,
	|		ДатаИВремяНачалаОказанияУслуги,
	|		ДлительностьОказанияУслуги,
	|		Сумма
	|	),
	|	ПриходноКассовыйОрдер.Таблица.(
	|		НомерСтроки,
	|		Номенклатура,
	|		НаборСвойств,
	|		ЕдИзм,
	|		Количество,
	|		Цена,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.ПриходноКассовыйОрдер КАК ПриходноКассовыйОрдер
	|ГДЕ
	|	ПриходноКассовыйОрдер.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьУслугиШапка = Макет.ПолучитьОбласть("УслугиШапка");
	ОбластьУслуги = Макет.ПолучитьОбласть("Услуги");
	ОбластьТаблицаШапка = Макет.ПолучитьОбласть("ТаблицаШапка");
	ОбластьТаблица = Макет.ПолучитьОбласть("Таблица");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьУслугиШапка);
		ВыборкаУслуги = Выборка.Услуги.Выбрать();
		Пока ВыборкаУслуги.Следующий() Цикл
			ОбластьУслуги.Параметры.Заполнить(ВыборкаУслуги);
			ТабДок.Вывести(ОбластьУслуги, ВыборкаУслуги.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьТаблицаШапка);
		ВыборкаТаблица = Выборка.Таблица.Выбрать();
		Пока ВыборкаТаблица.Следующий() Цикл
			ОбластьТаблица.Параметры.Заполнить(ВыборкаТаблица);
			ТабДок.Вывести(ОбластьТаблица, ВыборкаТаблица.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры

